In [3]:
import pandas as pd
import numpy as np

In [4]:
data = pd.Series(['a','b',np.nan,'d'])

In [5]:
data

0      a
1      b
2    NaN
3      d
dtype: object

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data[0] = None

In [8]:
data

0    None
1       b
2     NaN
3       d
dtype: object

In [9]:
data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
data.dropna()

1    b
3    d
dtype: object

In [11]:
data

0    None
1       b
2     NaN
3       d
dtype: object

In [12]:
data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [13]:
data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [14]:
data.fillna(3)

0    3
1    b
2    3
3    d
dtype: object

In [15]:
data

0    None
1       b
2     NaN
3       d
dtype: object

In [19]:
data.fillna(4)

0    4
1    b
2    4
3    d
dtype: object

In [20]:
data

0    None
1       b
2     NaN
3       d
dtype: object

      NA 处理方法  (判断 删除 替代)
      函数名     描述
      isnull       返回布尔值 含义: 是否为缺失值
      notnull     返回布尔值 含义 是否非 缺失值
      dropna     删除缺失值(删除包含缺失值的 行 or 列)
      fillna        填充缺失值(动态设定范围)

 ###  7.1.1  过滤缺失值

      目的: 判断缺失值  删除or替换缺失值   指定范围

In [22]:
from numpy import nan as na

In [23]:
data = pd.Series([1,na,4,na,7.3])

In [25]:
data

0    1.0
1    NaN
2    4.0
3    NaN
4    7.3
dtype: float64

In [26]:
data.dropna()

0    1.0
2    4.0
4    7.3
dtype: float64

In [27]:
data

0    1.0
1    NaN
2    4.0
3    NaN
4    7.3
dtype: float64

In [28]:
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [29]:
data.notnull

<bound method Series.notnull of 0    1.0
1    NaN
2    4.0
3    NaN
4    7.3
dtype: float64>

In [30]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [31]:
data.dropna()

0    1.0
2    4.0
4    7.3
dtype: float64

In [36]:
data[data.notnull()]

0    1.0
2    4.0
4    7.3
dtype: float64

In [34]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

     处理对象 DataFrame     
     drop(how='all , axis = 1, thresh=2)
     thresh: 保留包含一定数量的观察值

array([[0.73663042, 0.46963362, 0.25645929],
       [0.02477047, 0.90194724, 0.28407421],
       [0.5274983 , 0.75541681, 0.20574437],
       [0.15551624, 0.57531832, 0.48057163]])

In [54]:
df = pd.DataFrame(np.random.rand(12).reshape(4,3) ,index =list('abcd'),columns=list('zxc'))

In [55]:
df

          z         x         c
a  0.899852  0.239104  0.736790
b  0.763593  0.230388  0.663033
c  0.886995  0.054419  0.840007
d  0.371945  0.703515  0.425964

In [56]:
df.iloc[:1,:] = na

In [57]:
df

          z         x         c
a       NaN       NaN       NaN
b  0.763593  0.230388  0.663033
c  0.886995  0.054419  0.840007
d  0.371945  0.703515  0.425964

In [79]:
df.iloc[1:2,:2] = na
df.iloc[3:4,:1] = na
df.iloc[2:3,:1] = 234

In [80]:
df

       z         x         c
a    NaN       NaN       NaN
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [81]:
df.dropna()

       z         x         c
c  234.0  0.054419  0.840007

In [82]:
df

       z         x         c
a    NaN       NaN       NaN
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [83]:
df.isnull()

       z      x      c
a   True   True   True
b   True   True  False
c  False  False  False
d   True  False  False

In [84]:
df.dropna(how='all')

       z         x         c
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [85]:
df.dropna(thresh=2)

       z         x         c
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [86]:
df.dropna(thresh=3)

       z         x         c
c  234.0  0.054419  0.840007

In [87]:
df.dropna(thresh=1)

       z         x         c
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [100]:
df.insert(1,'q',[1,na,3,na])

In [101]:
df

       z    q         x         c
a    NaN  1.0       NaN       NaN
b    NaN  NaN       NaN  0.663033
c  234.0  3.0  0.054419  0.840007
d    NaN  NaN  0.703515  0.425964

In [89]:
df.dropna(axis=1,how='all')

       z         x         c
a    NaN       NaN       NaN
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [90]:
df.dropna(axis=1, thresh=1)

       z         x         c
a    NaN       NaN       NaN
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [92]:
df.dropna(axis=1,thresh=2)

          x         c
a       NaN       NaN
b       NaN  0.663033
c  0.054419  0.840007
d  0.703515  0.425964

In [93]:
df

       z         x         c
a    NaN       NaN       NaN
b    NaN       NaN  0.663033
c  234.0  0.054419  0.840007
d    NaN  0.703515  0.425964

In [94]:
df.dropna(axis=1,thresh=3)

          c
a       NaN
b  0.663033
c  0.840007
d  0.425964

In [97]:
df.dropna(axis=1,thresh=4)

Empty DataFrame
Columns: []
Index: [a, b, c, d]

### 7.1.2 补全缺失值

    目的: 补全 缺失值
    工具 : 
    fillna(value)
    fillna( {1:value, 2 :value} )
    fillna(method='ffill', limit=2, inplace=True, )

    fillna 函数参数 (value axis limit method inplace)
    参数       描述
    value      标量值 或 字典型对象 用于填充缺失值
    axis        需要填充的值  默认 axis = 0 即 填充 列 axis = 1 即 填充 行  
    limit       用于设置填充范围  (用于前向或后向填充是最大的 填充范围)
    method   默认"ffill"  插值方法 
    inplace    接收参数 bool类型 True: 直接修改对象  False: 不修改原对象 修改后生成新对象 (修改被调用的对象 而不是成更一个备份)